In [1]:
import pandas as pd
import geopandas as gpd
from collections import Counter
import matplotlib.pyplot as plt

%matplotlib inline

## 1. Reading in 'Energy Consumption' Data

#### --COAL

In [2]:
coal = pd.read_csv('data/energy_consumption/coal_clean.csv')
coal.head()

,year,month,type,all_sectors,electric,ind_power_producers,commercial_sector,industrial_sector
0,2019,January,coal,"55,834","41,306","14,305",8,214
1,2019,February,coal,"45,025","33,349","11,471",8,197
2,2019,March,coal,"43,974","31,664","12,133",9,168
3,2019,April,coal,"33,353","24,495","8,691",6,161
4,2019,May,coal,"40,015","30,285","9,547",6,178

In [3]:
coal.tail()

,year,month,type,all_sectors,electric,ind_power_producers,commercial_sector,industrial_sector
16,2020,May,coal,"26,849","19,805","6,898",4,142
17,2020,June,coal,"36,637","27,742","8,759",5,130
18,2020,July,coal,"49,838","38,279","11,411",5,143
19,2020,August,coal,"50,430","38,888","11,398",4,140
20,2020,Sept,coal,"38,701","29,619","8,927",7,149

#### --NATURAL GAS

In [4]:
natural_gas = pd.read_csv('data/energy_consumption/natural_gas_clean.csv')
natural_gas.head()

,year,month,type,all_sectors,electric_utilities,ind_power_producers,commercial_sector,industrial_sector
0,2019,January,natural gas,"873,247","441,597","373,529","4,566","53,555"
1,2019,February,natural gas,"801,042","411,828","338,638","4,217","46,359"
2,2019,March,natural gas,"835,654","431,525","350,686","4,516","48,926"
3,2019,April,natural gas,"762,539","398,908","313,343","4,173","46,115"
4,2019,May,natural gas,"863,102","458,692","350,386","4,217","49,806"

In [5]:
natural_gas.tail()

,year,month,type,all_sectors,electric_utilities,ind_power_producers,commercial_sector,industrial_sector
16,2020,May,natural gas,"853,523","456,172","346,972","3,804","46,574"
17,2020,June,natural gas,"1,067,619","556,783","457,006","4,249","49,581"
18,2020,July,natural gas,"1,396,437","715,032","623,770","5,046","52,588"
19,2020,August,natural gas,"1,304,306","665,469","580,958","4,980","52,899"
20,2020,Sept,natural gas,"1,058,029","536,040","469,587","4,484","47,918"

#### --PETROLIUM LIQUIDS

In [6]:
petro_liquids = pd.read_csv('data/energy_consumption/petro_liquid_clean.csv')
petro_liquids.head()

,year,month,type,all_sectors,electric_utilities,ind_power_producers,commercial_sector,industrial_sector
0,2019,January,petro liquids,"2,506","1,672",755,32,46
1,2019,February,petro liquids,"1,482","1,099",327,15,42
2,2019,March,petro liquids,"1,476","1,159",263,16,38
3,2019,April,petro liquids,"1,417","1,046",313,15,44
4,2019,May,petro liquids,"1,702","1,305",346,17,33

In [7]:
petro_liquids.tail()

,year,month,type,all_sectors,electric_utilities,ind_power_producers,commercial_sector,industrial_sector
16,2020,May,petro liquids,"1,288","1,010",227,20,31
17,2020,June,petro liquids,"1,569","1,232",287,20,30
18,2020,July,petro liquids,"1,747","1,343",348,25,31
19,2020,August,petro liquids,"1,674","1,316",311,24,23
20,2020,Sept,petro liquids,"1,411","1,129",233,23,27

#### --PETROLIUM COKE

In [8]:
petro_coke = pd.read_csv('data/energy_consumption/petro_coke_clean.csv')
petro_coke.head()

,year,month,type,all_sectors,electric_utilities,ind_power_producers,commercial_sector,industrial_sector
0,2019,January,petro coke,326,258,54,0,13
1,2019,February,petro coke,272,222,39,0,11
2,2019,March,petro coke,235,193,28,0,13
3,2019,April,petro coke,155,107,32,0,16
4,2019,May,petro coke,294,219,60,0,14

In [9]:
petro_coke.tail()

,year,month,type,all_sectors,electric_utilities,ind_power_producers,commercial_sector,industrial_sector
16,2020,May,petro coke,231,183,35,0,13
17,2020,June,petro coke,308,258,36,0,14
18,2020,July,petro coke,356,298,43,0,15
19,2020,August,petro coke,305,245,44,0,16
20,2020,Sept,petro coke,159,116,31,0,13

## 2. Reading in 'Transportation Trends' Data

#### --TSA

In [11]:
tsa = pd.read_csv('data/transportation/tsa/TSA_traveler_throughput.csv')
tsa.head()

         date  throughput  year
0  12/10/2020      754307  2020
1   12/9/2020      564372  2020
2   12/8/2020      501513  2020
3   12/7/2020      703546  2020
4   12/6/2020      837137  2020

In [12]:
tsa.tail()

         date  throughput  year
565  3/5/2019     2402692  2019
566  3/4/2019     2143619  2019
567  3/3/2019     1979558  2019
568  3/2/2019     2257920  2019
569  3/1/2019     2301439  2019

#### --Airline Traffic

In [14]:
airlines = pd.read_csv('data/transportation/airlines/air_traffic.csv')
airlines.head()

      month   2017   2018   2019   2020
0   January  62.62  64.43  67.02  70.76
1  February  58.38  61.72  63.58  67.81
2     March  72.96  76.29  80.21  39.06
3     April  70.26  73.63  76.43   3.01
4       May  73.68  77.30  81.35   8.43

In [15]:
airlines.tail()

        month   2017   2018   2019  2020
7      August  77.10  80.99  83.78   NaN
8   September  64.92  68.70  72.59   NaN
9     October  72.70  75.51  78.62   NaN
10   November  69.63  72.74  73.07   NaN
11   December  70.33  72.88  79.30   NaN

#### --Airline Fuel Consumption

In [19]:
airline_fuel = pd.read_csv('data/transportation/airlines/airlines_fuel_clean.csv')
airline_fuel.head()

,year,month,dom_consumption,dom_cost,dom_cost_per_gallon,int_consumption,int_cost,int_cost_per_gallon,total_consumption,total_cost,total_cost_per_gallon
0,2000,January,1108.6,766.5,0.69,386.8,313.6,0.81,1495.4,1080.1,0.72
1,2000,February,1068.4,772.3,0.72,366.8,298.7,0.81,1435.2,1071.1,0.75
2,2000,March,1174.3,875.5,0.75,399.7,330.1,0.83,1574.0,1205.6,0.77
3,2000,April,1145.3,841.9,0.74,407.9,336.7,0.83,1553.1,1178.7,0.76
4,2000,May,1174.2,833.3,0.71,434.4,337.9,0.78,1608.6,1171.2,0.73

In [20]:
airline_fuel.tail()

,year,month,dom_consumption,dom_cost,dom_cost_per_gallon,int_consumption,int_cost,int_cost_per_gallon,total_consumption,total_cost,total_cost_per_gallon
245,2020,June,393.5,442.9,1.13,164.4,161.0,0.98,558.0,603.9,1.08
246,2020,July,565.7,666.1,1.18,197.4,228.8,1.16,763.1,894.8,1.17
247,2020,August,589.0,713.8,1.21,212.5,254.6,1.20,801.4,968.4,1.21
248,2020,September,508.4,598.8,1.18,219.4,253.3,1.15,727.8,852.1,1.17
249,2020,October,568.9,650.5,1.14,238.5,267.0,1.12,807.4,917.5,1.14

#### --Urban and Rural Miles Traveled

In [21]:
rural_miles = pd.read_csv('data/transportation/traffic/rural_miles_traveled.csv')
rural_miles.head()

  month  year            system  miles_traveled
0   Jan  2019  Rural Interstate           18693
1   Feb  2019  Rural Interstate           16849
2   Mar  2019  Rural Interstate           20917
3    Q1  2019  Rural Interstate           56460
4   Jan  2019    Rural Arterial           27596

In [22]:
rural_miles.tail()

    month  year       system  miles_traveled
135    Q3  2020  Total Rural          247522
136   Jul  2020  All Systems          262461
137   Aug  2020  All Systems          251183
138   Sep  2020  All Systems          248277
139    Q3  2020  All Systems          761922

In [24]:
urban_miles = pd.read_csv('data/transportation/traffic/urban_miles_traveled.csv')
urban_miles.head()

  month  year            system  miles_traveled
0   Jan  2019  Urban Interstate           43946
1   Feb  2019  Urban Interstate           39812
2   Mar  2019  Urban Interstate           48101
3    Q1  2019  Urban Interstate          131859
4   Jan  2019    Urban Arterial           90386

In [25]:
urban_miles.tail()

    month  year       system  miles_traveled
135    Q3  2020  Total Urban          514400
136   Jul  2020  All Systems          262461
137   Aug  2020  All Systems          251183
138   Sep  2020  All Systems          248277
139    Q3  2020  All Systems          761922

## 3. Reading in 'Manufacturing Trends' Data